# IFCParameter Template Find Property Mapping Info Method

Source: https://www.revitapidocs.com/2026/33d78351-b6b9-e689-4c4b-d96263761c9a.htm

---

| IFCParameter Template Find Property Mapping Info Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | FindPropertyMappingInfo(PropertySetupType, String, ElementId) | Finds the property mapping info in the property set by id. |
|  | FindPropertyMappingInfo(PropertySetupType, String, String) | Finds the property mapping info in the property set by name. |

Top See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace